class sub:
    def f1(self, s1):
        return self.f2([], sorted(s1))

    def f2(self, curr, s1):
        if s1:
            return self.f2(curr, s1[1:]) + self.f2(curr + [s1[0]], s1[1:])
        return [curr]
a = []
n = int(input("Elements of list: "))
for i in range(0,n):
    b = int(input("Enter a number: "))
    a.append(b)
print("Subsets: ")
print(sub().f1(a))

# Дефинират се два метода (f1,f2).
# f1 - за празен списък
# f2 - се използва, за да изчисли всички възможни подмножества от списъка
# След въвеждане на параметърът от потребителя се извиква метод f1.
# От своя страна f1 извиква f2, f2 e рекурсивна функция.
# Този метод () изчислява всички възможни подмножества чрез разделяне на текущият списък
# част по част, започвайки от празен списък, на който постепенно се актуализира стойността.

